import { TimeSegmentData } from "../types/types";

export const historicalData: TimeSegmentData[] = [
  {
    id: "s1",
    startYear: 2016,
    endYear: 2022,
    category: "Спорт",
    events: [
      {
        year: "2016",
        description:
          "Летние Олимпийские игры в Рио-де-Жанейро, где впервые выступила сборная беженцев",
      },
      {
        year: "2017",
        description:
          "Криштиану Роналду получил свою пятую награду «Золотой мяч»",
      },
      {
        year: "2018",
        description:
          "Чемпионат мира по футболу в России, победа сборной Франции",
      },
      {
        year: "2019",
        description:
          "Элиуд Кипчоге впервые в истории пробежал марафон менее чем за 2 часа",
      },
      {
        year: "2021",
        description:
          "Летние Олимпийские игры в Токио, перенесенные на год из-за пандемии",
      },
      {
        year: "2022",
        description:
          "Зимние Олимпийские игры в Пекине и ЧМ по футболу в Катаре",
      },
    ],
  },
  {
    id: "s2",
    startYear: 2014,
    endYear: 2021,
    category: "Культура",
    events: [
      {
        year: "2014",
        description: "Выход фильма «Интерстеллар» Кристофера Нолана",
      },
      {
        year: "2015",
        description:
          "Публикация романа «Щегол» Донны Тартт, получившего Пулитцеровскую премию",
      },
      {
        year: "2016",
        description:
          "Музыкант Боб Дилан получил Нобелевскую премию по литературе",
      },
      {
        year: "2018",
        description:
          "Фильм «Черная Пантера» стал первым супергеройским фильмом, номинированным на «Оскар» за лучший фильм",
      },
      {
        year: "2019",
        description: "Заключительный эпизод сериала «Игра престолов»",
      },
      {
        year: "2021",
        description:
          "Релиз альбома «30» Адель, ставшего одним из самых продаваемых в десятилетии",
      },
    ],
  },
  {
    id: "s3",
    startYear: 2017,
    endYear: 2023,
    category: "Наука",
    events: [
      {
        year: "2017",
        description:
          "Первое обнаружение гравитационных волн от слияния нейтронных звезд",
      },
      {
        year: "2018",
        description:
          "Ученые впервые отредактировали гены человеческих эмбрионов с помощью CRISPR",
      },
      {
        year: "2019",
        description: "Получено первое в истории изображение черной дыры",
      },
      {
        year: "2020",
        description:
          "Разработка первых вакцин против COVID-19 в рекордные сроки",
      },
      {
        year: "2022",
        description:
          "Первое успешное испытание системы защиты Земли от астероидов (миссия DART)",
      },
      {
        year: "2023",
        description:
          "Искусственный интеллект AlphaFold предсказал структуры почти всех известных науке белков",
      },
    ],
  },
  {
    id: "s4",
    startYear: 2015,
    endYear: 2022,
    category: "Медицина",
    events: [
      {
        year: "2015",
        description:
          "Первая успешная пересадка лица в США с полным функциональным восстановлением",
      },
      {
        year: "2016",
        description:
          "Разработка первой искусственной матки для крайне недоношенных ягнят",
      },
      {
        year: "2017",
        description:
          "Утверждение первого генотерапевтического препарата (Kymriah) для лечения лейкемии",
      },
      {
        year: "2018",
        description:
          "Первая успешная трансплантация выращенного в лаборатории легкого человеку",
      },
      {
        year: "2020",
        description:
          "Быстрое создание и тестирование вакцин против COVID-19 с использованием мРНК-технологии",
      },
      {
        year: "2022",
        description:
          "Первая полная пересадка свиного сердца человеку с генетической модификацией органа",
      },
    ],
  },
  {
    id: "s5",
    startYear: 2013,
    endYear: 2021,
    category: "Экология",
    events: [
      {
        year: "2013",
        description:
          "Концентрация CO₂ в атмосфере впервые превысила 400 ppm за всю историю наблюдений",
      },
      {
        year: "2015",
        description: "Принятие Парижского климатического соглашения на COP21",
      },
      {
        year: "2017",
        description:
          "Китай объявил о планах создания крупнейшей в мире системы торговли квотами на выбросы",
      },
      {
        year: "2018",
        description:
          "Швеция первой в мире начала использовать технологию улавливания и хранения углерода (CCS)",
      },
      {
        year: "2019",
        description:
          "Глобальные климатические забастовки, инициированные Гретой Тунберг",
      },
      {
        year: "2021",
        description:
          "Запрет одноразового пластика в странах ЕС и запуск проекта «Great Green Wall» в Африке",
      },
    ],
  },
  {
    id: "s6",
    startYear: 2015,
    endYear: 2022,
    category: "Политика",
    events: [
      {
        year: "2015",
        description:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        year: "2016",
        description:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        year: "2017",
        description:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        year: "2015",
        description:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        year: "2016",
        description:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        year: "2016",
        description:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
    ],
  },
];
